#اجرب حاليا بس clear ومهمته يحذف اللسته كلها بس
a =["feras", "ashil", "mohammed"]
a.clear()
print(a)


#تعلمت هنا كيف اطبع لسته لي لسته ثانية بإستخدام copy
b=[1, 2, 3, 4]
c= b.copy()
print(b)
print(c)


#هذا الامر يقوم بعد الشيء الذي تطلب منه عده في القائمة
#count
c=[1, 2, 3, 4, 1, 4, 6, 1]
print(c.count(1))


#هنا يقوم بعد من الصفر الا العدد الخانه المطلوبة والي هو الانداكس ولازم تكون فاهم ذا الشيء لو تشتي تكون مبرمج
#index
e=["feras", "ashil", "mohammed", "glal", "haytham"]
print(e.index("glal"))


#يقوم هذا الكود بنفس عمل append ولاكن انت تختار اين تعة بضبط
#insert
#لا تستعمل الكود كله في print() لانه بيطلع لك فاضي
f=[1, 2, 3, 4, "A", "B"]
f.insert(-1, "C")
print(f)


#هذا الكود يخرج الشيء الي طلبته من القائمة ويرجة مره ثاني
#pop()
g=[1, 2, 3, 4, 5]
print(g.pop(-3))